code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаПодтвержденийСубброкераПоРСВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаПодтвержденийСубброкераПоРСВ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументРаскрытия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодLEIСубброкера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеференсКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросНаРСВ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗапросСубброкеруНаРаскрытие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АмериканскаяЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗапросаРСВПоДаннымКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксацииПоДаннымКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксацииРСВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматФайлаОтветовНаЗапросыРСВ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подтверждения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ISIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LEIКодСубброкера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресМестонахожденияРегистрацииАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресМестонахожденияРегистрацииИндекс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресМестонахожденияРегистрацииСтрана</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПочтовыйАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПочтовыйИндекс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПочтовыйСтрана</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГражданствоФЛ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРожденияФЛ</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорСубброкера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаОрганВыдачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаСерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаТип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДокументыЮридическихЛиц</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЗагрузкиЦБ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСубброкера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСубклиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеНалоговыхЛьгот</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяСтавка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСчетаДепоКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименованиеЛица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименованиеЮЛФЛСубклиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЮЛФЛ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусНалогоплательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субброкер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субклиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыКорпоративныхДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКорпоративныхДействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добровольное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обязательное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольноеИнструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаПодтвержденийСубброкераПоРСВ/Forms/Форма/Ext/Form/Module.bsl
/////////////////////////////////////////////////////////////////////////////
////#Область ОбработчикиСобытийФормыИЭлементовФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаЗагружаемыеПоля.Видимость = Ложь;
	ИспользоватьРегистрациюЗапросовСубброкера = WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкера();
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПолноеИмяФайла = Объект.ПолноеИмяФайла;
	Диалог.Заголовок = "Выберите файл подтверждения раскрытия от субброкера";
	Диалог.Фильтр = "Файлы подтверждения раскрытия (*.xml)|*.xml|" +
	"Документ Microsoft Excel (*.xlsx)|*.xlsx|";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.ПредварительныйПросмотр = Ложь;
	
	ВозвращаемоеЗначение = Диалог.Выбрать();	
	Если ВозвращаемоеЗначение Тогда
		Объект.ПолноеИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

////#КонецОбласти

/////////////////////////////////////////////////////////////////////////////
////#Область ОбработчикиКоманд

&НаКлиенте
Процедура Загрузить(Команда)
	Ошибки = Неопределено;
	Если НЕ ЗначениеЗаполнено(Объект.НомерДокумента) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,, "Не указан номер документа!");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаДокумента) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,, "Не указана дата документа!");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДокументРаскрытия) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,, "Не указан документ раскрытия!");
	КонецЕсли;	
	Если Объект.Подтверждения.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,, "Нет подтверждений субброкера!");
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДокументРаскрытия) И Не ЗначениеЗаполнено(Объект.ЗапросНаРСВ) Тогда
		Если ИспользоватьРегистрациюЗапросовСубброкера Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,, "Не указан запрос на раскрытие!");
		КонецЕсли;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Ошибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДанныеПодтвержденияНаСервере();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Подтверждения субброкера загружены в " + Объект.ДокументРаскрытия);
	Оповестить("Документ.ЗапросСубброкеруНаРаскрытие.Изменен",Объект.ДокументРаскрытия);
	ОповеститьОбИзменении(Объект.ЗапросНаРСВ);
КонецПроцедуры

&НаКлиенте
Процедура Прочитать(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПолноеИмяФайла) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан файл!");
		Возврат;
	КонецЕсли;
	
	Если Объект.Подтверждения.Количество() > 0 Тогда
		Ответ = Вопрос("Данные будут перезагружены. Продолжить?", РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Подтверждения.Очистить();
		Элементы.ФормаЗагрузить.Доступность = Истина;
	КонецЕсли;
	Файл = Новый Файл(Объект.ПолноеИмяФайла);
	Если НРег(Файл.Расширение) = ".xlsx" Тогда
		ПрочитатьФайлСубброкера();
	ИначеЕсли НРег(Файл.Расширение) = ".xml" Тогда
		ПрочитатьФайлСубброкераXML();
		Если ЗначениеЗаполнено(Объект.ДатаФиксацииРСВ) И 
			Объект.ДатаФиксацииПоДаннымКлиента <> Объект.ДатаФиксацииРСВ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата фиксации в РСВ " + Объект.ДатаФиксацииРСВ
				+ " не совпадает с Датой фиксации в Ответе " + Объект.ДатаФиксацииПоДаннымКлиента);
			Элементы.ФормаЗагрузить.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	ДополнитьПодтвержденияСсылкамиНаОбъекты();
	Если ИспользоватьРегистрациюЗапросовСубброкера Тогда 
		ПодобратьДокументЗапросаНаРСВ(Объект.НомерЗапросаРСВПоДаннымКлиента);
		Элементы.ЗапросНаРСВ.Видимость = Истина;
	Иначе 
		Элементы.ЗапросНаРСВ.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЗапросНаРСВ) И НЕ СчетДепоСоответствуетСчетуРСВ(Объект.СчетДепо, Объект.ЗапросНаРСВ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счет Депо в Ответе не совпадает со счетом депо в Запросе Субброкеру");
		Элементы.ФормаЗагрузить.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

////#КонецОбласти

/////////////////////////////////////////////////////////////////////////////
////#Область Вспомогательные

&НаКлиенте
Процедура ПрочитатьФайлСубброкера()
	
	ДвоичныеДанные = Новый ДвоичныеДанные(Объект.ПолноеИмяФайла);
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	ПрочитатьФайлСубброкераСервер(Адрес);
	
КонецПроцедуры


&НаСервере
Процедура ПрочитатьФайлСубброкераСервер(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	ИмяВремФайла = ПолучитьИмяВременногоФайла("XLSX");
	ДвоичныеДанные.Записать(ИмяВремФайла);
	
	Попытка
		ДанныеФайла = Новый ТабличныйДокумент;
		ДанныеФайла.Прочитать(ИмяВремФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Ошибка открытия файла '%1': %2", Объект.ПолноеИмяФайла, ОписаниеОшибки()));
		Возврат;
	КонецПопытки;
	
	ПрочитатьНомерДокумента(ДанныеФайла);
	ПрочитатьДатуДокумента(ДанныеФайла);
	ПрочитатьLEI(ЧислоВСтроку(ДанныеФайла.Область(4, 9).Текст));
	ПрочитатьСчетДепо(ЧислоВСтроку(ДанныеФайла.Область(5, 9).Текст));
	ПрочитатьРеференсКД(УдалениеПробеловИзСтроки(ДанныеФайла.Область(6, 9).Текст));
	ПрочитатьВидКД(ДанныеФайла.Область(8, 9).Текст);
	ПодобратьДокументРСВ();
	Если ЗначениеЗаполнено(Объект.ДокументРаскрытия) Тогда
		ПрочитатьЦеннуюБумагу(ДанныеФайла.Область(11, 9).Текст);	
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось загрузить ценную бумагу, так как не найден документ раскрытия!");;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВидКД) И  ЗначениеЗаполнено(Объект.СчетДепо)Тогда
		Если ИспользоватьРегистрациюЗапросовСубброкера Тогда
			ПрочитатьПодтвержденияВЗапросыСубброкера(ДанныеФайла);
		Иначе 
			ПрочитатьПодтверждения(ДанныеФайла);
		КонецЕсли;
	КонецЕсли;
	
	УдалитьФайлы(ИмяВремФайла);
	
КонецПроцедуры

&НаСервере
Функция ЧислоВСтроку(ЗначЧисло)
	Если ТипЗнч(ЗначЧисло) = Тип("Число") Тогда
		Возврат Формат(ЗначЧисло, "ЧГ=0");
	Иначе
		Возврат СокрЛП(ЗначЧисло);
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПрочитатьНомерДокумента(ДанныеФайла)
	Для НомерКолонки = 2 По 4 Цикл
		Объект.НомерДокумента = ДанныеФайла.Область(2, НомерКолонки).Текст;
		Если ЗначениеЗаполнено(Объект.НомерДокумента) Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле не указан номер документа");
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДатуДокумента(ДанныеФайла)
	Для НомерКолонки = 6 По 9 Цикл
		ДатаДокумента = СокрЛП(ДанныеФайла.Область(2, НомерКолонки).Текст);
		Попытка
			Объект.ДатаДокумента = СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьДатуПоСтрокеДДММГГ(ДатаДокумента);
		Исключение
			Объект.ДатаДокумента = Дата(1, 1, 1);
		КонецПопытки;
		Если ЗначениеЗаполнено(Объект.ДатаДокумента) Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле не указана дата документа");
КонецПроцедуры

&НаСервере
Процедура ПрочитатьLEI(КодLEI)
	Объект.КодLEIСубброкера = КодLEI;
	Если НЕ ЗначениеЗаполнено(Объект.КодLEIСубброкера) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле не указан код LEI");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРеференсКД(РеференсКД)
	Объект.РеференсКД = РеференсКД;
	Если НЕ ЗначениеЗаполнено(Объект.РеференсКД) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле не указан референс КД");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСчетДепо(КодСчетаДепо)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СчетДепо = Справочники.СчетаДепо.НайтиПоКоду(КодСчетаДепо);
	Если НЕ ЗначениеЗаполнено(ОбработкаОбъект.СчетДепо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Не найден счет депо с кодом '%1'", КодСчетаДепо));
	КонецЕсли;
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Функция ПрочитатьВидКД(Знач ВхКодВидаКД)
	Объект.КодВидаКД = СокрЛП(ВхКодВидаКД);
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВидКД = Справочники.ВидыКорпоративныхДействий.НайтиПоКоду(Объект.КодВидаКД);
	Если НЕ ЗначениеЗаполнено(ОбработкаОбъект.ВидКД) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Не найден вид корп. действия с кодом '%1'", Объект.КодВидаКД));
		Возврат Неопределено;
	КонецЕсли;
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	НалоговаяСтавкаОбязательна = WTRCСообщенияQI.НалоговаяСтавкаОбязательна(Объект.ВидКД);
	Объект.ФорматФайла = Перечисления.ФорматФайлаОтветовНаЗапросыРСВ.Excel;
КонецФункции

&НаСервере
Процедура ПрочитатьЦеннуюБумагу(ISIN)
	
	ОписаниеРеквизитовЦБ = Новый Структура("Ссылка1, ISIN1, Ссылка2, ISIN2", "ЦеннаяБумага1", "ЦеннаяБумага1.ISIN", "ЦеннаяБумага2", "ЦеннаяБумага2.ISIN");
	РеквизитыЦБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументРаскрытия, ОписаниеРеквизитовЦБ);
	Если РеквизитыЦБ.ISIN1 = ISIN Тогда
		Объект.ЦеннаяБумага = РеквизитыЦБ.Ссылка1;
	ИначеЕсли РеквизитыЦБ.ISIN2 = ISIN Тогда
		Объект.ЦеннаяБумага = РеквизитыЦБ.Ссылка2;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ISIN ценной бумаги указанный в файле отличается от указанного в РСВ!");	
	КонецЕсли;
	Объект.АмериканскаяЦБ = Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(Объект.ЦеннаяБумага);
	
КонецПроцедуры

&НаСервере
Функция ВидКДВыплатаДоходов()
	Возврат Объект.ВидКД.ТипКорпоративныхДействий = Перечисления.ТипыКорпоративныхДействий.Доход
	ИЛИ Объект.ВидКД.Код = "WTRC";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УбартьНеЗначащиеСимволы(Знач ВхСтрока)
	
	ВыхСтрока = "";
	Для Сч = 0 По СтрДлина(ВхСтрока) Цикл 
		ТекущийСимвол = Сред(ВхСтрока,Сч,1);
		КодТекущегоСимвола = КодСимвола(ТекущийСимвол);
		Если КодТекущегоСимвола >= 48 И КодТекущегоСимвола <= 57 
			ИЛИ КодТекущегоСимвола >= 65 И КодТекущегоСимвола <= 90
			ИЛИ КодТекущегоСимвола >= 97 И КодТекущегоСимвола <= 122
			ИЛИ КодТекущегоСимвола >= 1040 И КодТекущегоСимвола <= 1103 Тогда 
				ВыхСтрока = ВыхСтрока + ТекущийСимвол;
		КонецЕсли;
	КонецЦикла;
	Возврат ВыхСтрока;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтрокиЭквивалентны(Знач Строка1, Знач Строка2)

	Возврат ВРег(УбартьНеЗначащиеСимволы(Строка1)) = ВРег(УбартьНеЗначащиеСимволы(Строка2));

КонецФункции

&НаСервере
Процедура УстановитьНомераКолонок(ПараметрыКолонок, ДанныеФайла, НомерСтрокиФайла = 17 )
		
	Если НомерСтрокиФайла < 3 Тогда 
		Возврат;
	КонецЕсли;
	
	Для СчетчикКолонок = 1 По 100 Цикл
		СтрокаШапки1 = СокрЛП(ДанныеФайла.Область(НомерСтрокиФайла - 3, СчетчикКолонок).Текст);
		СтрокаШапки2 = СокрЛП(ДанныеФайла.Область(НомерСтрокиФайла - 2, СчетчикКолонок).Текст);
		СтрокаШапки3 = СокрЛП(ДанныеФайла.Область(НомерСтрокиФайла - 1, СчетчикКолонок).Текст);
		
		Если СтрокиЭквивалентны(СтрокаШапки1,"Код клиента")  Тогда 
			ПараметрыКолонок.КодКлиента.НомерКолонки = СчетчикКолонок;
		ИначеЕсли СтрокиЭквивалентны(СтрокаШапки1,"Раздел счета Депо") Тогда
			ПараметрыКолонок.РазделСчетаДепо.НомерКолонки = СчетчикКолонок;
		ИначеЕсли СтрокиЭквивалентны(СтрокаШапки1,"Тип счета") Тогда
			ПараметрыКолонок.ТипСчета.НомерКолонки = СчетчикКолонок;
		ИначеЕсли СтрокиЭквивалентны(СтрокаШапки1,"Полное наименование юридического лица/Ф.И.О. Физического лица") Тогда
			ПараметрыКолонок.ПолноеНаименованиеЛица.НомерКолонки = СчетчикКолонок;
		ИначеЕсли СтрокиЭквивалентны(СтрокаШапки1 , "(Адрес местонахождения/ регистрации)") 
			И СтрокиЭквивалентны(СтрокаШапки2 , "Страна") Тогда
			ПараметрыКолонок.АдресМестонахожденияРегистрацииСтрана.НомерКолонки = СчетчикКолонок;	
			ПараметрыКолонок.АдресМестонахожденияРегистрацииИндекс.НомерКолонки = СчетчикКолонок + 1;	
			ПараметрыКолонок.АдресМестонахожденияРегистрацииАдрес.НомерКолонки = СчетчикКолонок  + 2;	
		ИначеЕсли СтрокиЭквивалентны(СтрокаШапки1 , "Признак юридического/ физического лица") Тогда
			ПараметрыКолонок.ПризнакЮЛФЛ.НомерКолонки = СчетчикКолонок;
		ИначеЕсли СтрокиЭквивалентны(СтрокаШапки1 , "Данные документа владельца (лица, осуществляющего права по ценным бумагам)") 
			И СтрокиЭквивалентны(СтрокаШапки2 , "Тип") Тогда
			ПараметрыКолонок.ДокументВладельцаТип.НомерКолонки = СчетчикКолонок;
			ПараметрыКолонок.ДокументВладельцаНомер.НомерКолонки = СчетчикКолонок + 1;
			ПараметрыКолонок.ДокументВладельцаСерия.НомерКолонки = СчетчикКолонок + 2;
			ПараметрыКолонок.ДокументВладельцаДатаВыдачи.НомерКолонки = СчетчикКолонок + 3;
			ПараметрыКолонок.ДокументВладельцаОрганВыдачи.НомерКолонки = СчетчикКолонок + 4;
			ПараметрыКолонок.ДатаРожденияФЛ.НомерКолонки = СчетчикКолонок + 5;
			ПараметрыКолонок.ГражданствоФЛ.НомерКолонки = СчетчикКолонок + 6;
		ИначеЕсли СтрокиЭквивалентны(СтрокаШапки1 , "Наименование юридического лица или ФИО физического лица и адрес для направления корреспонденции")
			И СтрокиЭквивалентны(СтрокаШапки2 , "Наименование/ ФИО") Тогда
			ПараметрыКолонок.ПолноеНаименованиеЮЛФЛСубклиента.НомерКолонки = СчетчикКолонок;
			ПараметрыКолонок.АдресПочтовыйСтрана.НомерКолонки = СчетчикКолонок + 1;
			ПараметрыКолонок.АдресПочтовыйИндекс.НомерКолонки = СчетчикКолонок + 2;
			ПараметрыКолонок.АдресПочтовыйАдрес.НомерКолонки = СчетчикКолонок + 3;
		ИначеЕсли СтрокиЭквивалентны(СтрокаШапки1 , "Статус налогоплательщика") Тогда
			ПараметрыКолонок.СтатусНалогоплательщика.НомерКолонки = СчетчикКолонок;
			ПараметрыКолонок.НаличиеНалоговыхЛьгот.НомерКолонки = СчетчикКолонок + 1;
			ПараметрыКолонок.НалоговаяСтавка.НомерКолонки = СчетчикКолонок + 2;	
		ИначеЕсли Найти(СтрокаШапки1, "Код LEI/BIC SWIFT") Тогда 
			ПараметрыКолонок.LEIКодСубброкера.НомерКолонки = СчетчикКолонок;
		ИначеЕсли СтрокиЭквивалентны(СтрокаШапки1 , "ISIN/ номер гос регистрации выпуска ценных бумаг") Тогда 
			ПараметрыКолонок.ISIN.НомерКолонки = СчетчикКолонок;
		ИначеЕсли СтрокиЭквивалентны(СтрокаШапки1 , "Код НКО АО НРД") Тогда 
			ПараметрыКолонок.КодЗагрузкиЦБ.НомерКолонки = СчетчикКолонок;
		ИначеЕсли СтрокиЭквивалентны(СтрокаШапки1 , "Количество ценных бумаг,шт.") Тогда 
			ПараметрыКолонок.Количество.НомерКолонки = СчетчикКолонок;
		ИначеЕсли СтрокиЭквивалентны(СтрокаШапки1 , "Номер счета Депо") Тогда 
			ПараметрыКолонок.НомерСчетаДепоКлиента.НомерКолонки = СчетчикКолонок;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазделСчетаДепо(КодРазделаСчетаДепо)
	Возврат Справочники.РазделыСчетаДепо.НайтиПоКоду(КодРазделаСчетаДепо);
КонецФункции // РазделСчетаДепо()

&НаСервере
Функция ПараметрыКолонокФайлаРасшифровкиЗапросаНаРаскрытие(ВидКорпоративногоДействияСсылка)
	Если ЗначениеЗаполнено(Объект.ЦеннаяБумага) Тогда 
		Возврат WTRCСообщенияQI.ПараметрыКолонокФайлаРасшифровкиЗапросаНаРаскрытие(Объект.ЦеннаяБумага, ВидКорпоративногоДействияСсылка);

	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ДанныеСтрокиИзТабличногоДокумента(ДанныеФайла, НомерСтрокиФайла, ПараметрыКолонок, Отказ)
	
	ДанныеСтроки = ОбщегоНазначения.СкопироватьСтруктуру(ПараметрыКолонок);
	Для Каждого Элемент Из ПараметрыКолонок Цикл
		Значение = Неопределено;
		Ссылка = Неопределено;
		ДанныеСтроки[Элемент.Ключ].Вставить("Значение",Значение);
		ДанныеСтроки[Элемент.Ключ].Вставить("Ссылка", Ссылка);

		Если Не ЗначениеЗаполнено(Элемент.Значение.НомерКолонки) Тогда 
			Продолжить;
		КонецЕсли;
		
		Ячейка = ДанныеФайла.Область(НомерСтрокиФайла, Элемент.Значение.НомерКолонки);
		
		Если ЗначениеЗаполнено(Элемент.Значение.ДоступныеЗначения) Тогда
			Значение = СокрЛП(Ячейка.Текст);
			Ссылка = Элемент.Значение.ДоступныеЗначения.Получить(Значение);
			
			Если Не Элемент.Значение.Обязательная
				И Не ЗначениеЗаполнено(Ячейка.Текст) Тогда 
			    Значение = "";
				Ссылка = Неопределено;
			ИначеЕсли НЕ Элемент.Ключ = "ДокументВладельцаТип" И
				Ссылка = Неопределено Тогда 
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"Ошибка формата значения в строке %1 в колонке %2: недопустимое значение", НомерСтрокиФайла, Элемент.Значение.НомерКолонки));		
			КонецЕсли;
		ИначеЕсли Элемент.Значение.ТипЗначения = Тип("Число") Тогда
			Если ЗначениеЗаполнено(Ячейка.Текст) Тогда 
				Значение = ЗначениеЯчейки(Ячейка);
				Попытка
					Значение = Число(Значение);
				Исключение
					Если ЗначениеЗаполнено(Значение) Тогда 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						"Ошибка формата значения в строке %1 в колонке %2: не удалось разобрать число", НомерСтрокиФайла, Элемент.Значение.НомерКолонки));
						Значение = "";
					КонецЕсли;
				КонецПопытки;
			Иначе
				Значение = "";
			КонецЕсли;	
		ИначеЕсли Элемент.Значение.ТипЗначения = Тип("Дата") Тогда
			Значение = Ячейка.Текст;
			Попытка
				Значение = СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьДатуИзСтроки(Лев(Значение,10));
			Исключение
				Если ЗначениеЗаполнено(Значение) Тогда 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"Ошибка формата значения в строке %1 в колонке %2: не удалось разобрать дату", НомерСтрокиФайла, Элемент.Значение.НомерКолонки));
				КонецЕсли;
				Значение = Дата(1,1,1);
			КонецПопытки;
			
		Иначе
			Значение = Ячейка.Текст;
		КонецЕсли;
		
		Если Элемент.Значение.Обязательная И ТипЗнч(Значение) <> Тип("Число") И Не ЗначениеЗаполнено(Значение) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"Ошибка формата значения в строке %1 в колонке %2: пустое значение", НомерСтрокиФайла, Элемент.Значение.НомерКолонки));	
		КонецЕсли;
		
		ДанныеСтроки[Элемент.Ключ].Значение = Значение;
		ДанныеСтроки[Элемент.Ключ].Ссылка = Ссылка;
		
	КонецЦикла;

	Возврат ДанныеСтроки;
	
КонецФункции

&НаСервере
Функция ЗначениеЯчейки(Ячейка)
	Попытка
		Возврат Ячейка.Значение;
	Исключение
		Возврат Ячейка.Текст;
	КонецПопытки;
КонецФункции

&НаСервереБезКонтекста
Функция УдалениеПробеловИзСтроки(Знач Текст)
	Текст = СтрЗаменить(Текст,Символы.НПП,"");
	Текст = СтрЗаменить(Текст,Символы.Таб,"");
	Текст = СтрЗаменить(Текст,Символы.ПС,"");
	Текст = СтрЗаменить(Текст,Символы.ВК,"");
	Текст = СтрЗаменить(Текст," ","");
	Возврат Текст;
КонецФункции


&НаСервере
Процедура ПрочитатьПодтвержденияВЗапросыСубброкера(ДанныеФайла)
	
	НомерСтрокиФайла = 17;
	ISIN = ДанныеФайла.Область(11, 9).Текст;
	ЗначенияКлючевыхПолей = Новый Массив();
	
	ПараметрыКолонок = ПараметрыКолонокФайлаРасшифровкиЗапросаНаРаскрытие(Объект.ВидКД);
	Если ПараметрыКолонок = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить параметры колонок для ЦБ с ISIN: " + ISIN);
		Возврат;	
	КонецЕсли;
	УстановитьНомераКолонок(ПараметрыКолонок, ДанныеФайла);
	
	Если ПараметрыКолонок.Количество.НомерКолонки = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не верный формат файла - не найдена колонка Количество");
		Возврат;	
	КонецЕсли;
	
	Отказ = Ложь;
	Пока ЗначениеЗаполнено(ДанныеФайла.Область(НомерСтрокиФайла, ПараметрыКолонок.Количество.НомерКолонки).Текст) Цикл
		
		ДанныеСтроки = ДанныеСтрокиИзТабличногоДокумента(ДанныеФайла, НомерСтрокиФайла, ПараметрыКолонок, Отказ);
				
		// Проверка уникальности строк по ключевому полю
		Если ПараметрыКолонок.КодКлиента.Ключевая  Тогда
			Если ЗначенияКлючевыхПолей.Найти(ДанныеСтроки.КодКлиента.Значение) = Неопределено Тогда 
				ЗначенияКлючевыхПолей.Добавить(ДанныеСтроки.КодКлиента.Значение);
			Иначе 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"Ошибка в строке %1 в колонке %2 - клиент с таким кодом загружен ранее. Строка будет пропущена.", 
				НомерСтрокиФайла, ПараметрыКолонок.КодКлиента.НомерКолонки));
				НомерСтрокиФайла = НомерСтрокиФайла + 1;
				Продолжить;
			КонецЕсли;
		Иначе
			Если ЗначенияКлючевыхПолей.Найти(ДанныеСтроки.НомерСчетаДепоКлиента.Значение) = Неопределено Тогда 
				ЗначенияКлючевыхПолей.Добавить(ДанныеСтроки.НомерСчетаДепоКлиента.Значение);
			Иначе 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"Ошибка в строке %1 в колонке %2 - клиент с таким номером счета загружен ранее. Строка будет пропущена.", 
				НомерСтрокиФайла, ПараметрыКолонок.НомерСчетаДепоКлиента.НомерКолонки));
				НомерСтрокиФайла = НомерСтрокиФайла + 1;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
				
		НоваяСтрока = Объект.Подтверждения.Добавить();
		НоваяСтрока.СчетДепо		= Объект.СчетДепо;
		НоваяСтрока.НомерСчетаДепоКлиента = ДанныеСтроки.НомерСчетаДепоКлиента.Значение;
		НоваяСтрока.Количество = ДанныеСтроки.Количество.Значение;
		КодРазделаСчетаДепо = ДанныеСтроки.РазделСчетаДепо.Значение;
		
		Если Объект.АмериканскаяЦБ И Объект.КодВидаКД = "WTRC" Тогда
			НоваяСтрока.КодКлиента =  ДанныеСтроки.КодКлиента.Значение;
		КонецЕсли;
		
		Если ПустаяСтрока(КодРазделаСчетаДепо) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Ошибка формата значения в строке %1 в колонке %2 - не указан раздел счета депо", НомерСтрокиФайла, ДанныеСтроки.РазделСчетаДепо.НомерКолонки));
			Прервать;
		Иначе 
			НоваяСтрока.РазделСчетаДепо = РазделСчетаДепо(КодРазделаСчетаДепо);
			Если Не ЗначениеЗаполнено(НоваяСтрока.РазделСчетаДепо) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"Ошибка формата значения в строке %1 в колонке %2 - по указанному коду не найден раздел счета депо", НомерСтрокиФайла,ДанныеСтроки.РазделСчетаДепо. НомерКолонки));
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
	
		// Налоги
		НоваяСтрока.СтатусНалогоплательщика	= ДанныеСтроки.СтатусНалогоплательщика.Значение;
		НоваяСтрока.НаличиеНалоговыхЛьгот	= ДанныеСтроки.НаличиеНалоговыхЛьгот.Значение;
		НоваяСтрока.НалоговаяСтавка			= ДанныеСтроки.НалоговаяСтавка.Значение;
		НоваяСтрока.КодЗагрузкиЦБ 			= ДанныеСтроки.КодЗагрузкиЦБ.Значение;
		НоваяСтрока.ПолноеНаименованиеЛица  = ДанныеСтроки.ПолноеНаименованиеЛица.Значение;
		НоваяСтрока.КодСубброкера = "";
		НоваяСтрока.КодСубклиента = "";
		
		КодКлиента = ДанныеСтроки.КодКлиента.Значение;
		Если ЗначениеЗаполнено(КодКлиента) Тогда 
			НоваяСтрока.КодКлиента = КодКлиента;
			ПозицияРазделителя = Найти(КодКлиента, "_");
			Если ПозицияРазделителя > 0 Тогда
				НоваяСтрока.КодСубброкера = Лев(КодКлиента, ПозицияРазделителя - 1);	
				НоваяСтрока.КодСубклиента = Сред(КодКлиента, ПозицияРазделителя + 1);
			Иначе 
				НоваяСтрока.Субклиент = НоваяСтрока.ПолноеНаименованиеЛица;
				НоваяСтрока.КодСубброкера = "";	
				НоваяСтрока.КодСубклиента = КодКлиента;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока.LEIКодСубброкера = ДанныеСтроки.LEIКодСубброкера.Значение;
		НоваяСтрока.ISIN = ДанныеСтроки.ISIN.Значение;
		НоваяСтрока.ТипСчета = ДанныеСтроки.ТипСчета.Значение;
		
		НоваяСтрока.АдресМестонахожденияРегистрацииСтрана 	= ДанныеСтроки.АдресМестонахожденияРегистрацииСтрана.Ссылка;
		НоваяСтрока.АдресМестонахожденияРегистрацииИндекс 	= ДанныеСтроки.АдресМестонахожденияРегистрацииИндекс.Значение;
		НоваяСтрока.АдресМестонахожденияРегистрацииАдрес	= ДанныеСтроки.АдресМестонахожденияРегистрацииАдрес.Значение;
		НоваяСтрока.ПризнакЮЛФЛ = ДанныеСтроки.ПризнакЮЛФЛ.Ссылка;
		Если ЗначениеЗаполнено(ДанныеСтроки.ДокументВладельцаТип.Ссылка) Тогда 
			НоваяСтрока.ДокументВладельцаТип = ДанныеСтроки.ДокументВладельцаТип.Ссылка;
		Иначе
			НоваяСтрока.ДокументВладельцаТип = ДанныеСтроки.ДокументВладельцаТип.Значение;
		КонецЕсли;
		НоваяСтрока.ДокументВладельцаНомер = ДанныеСтроки.ДокументВладельцаНомер.Значение;
		НоваяСтрока.ДокументВладельцаСерия = ДанныеСтроки.ДокументВладельцаСерия.Значение;
		НоваяСтрока.ДокументВладельцаДатаВыдачи = ДанныеСтроки.ДокументВладельцаДатаВыдачи.Значение;
		НоваяСтрока.ДокументВладельцаОрганВыдачи = ДанныеСтроки.ДокументВладельцаОрганВыдачи.Значение;
		НоваяСтрока.ДатаРожденияФЛ = ДанныеСтроки.ДатаРожденияФЛ.Значение;
		НоваяСтрока.ГражданствоФЛ = ДанныеСтроки.ГражданствоФЛ.Ссылка;
		НоваяСтрока.ПолноеНаименованиеЮЛФЛСубклиента = ДанныеСтроки.ПолноеНаименованиеЮЛФЛСубклиента.Значение;
		НоваяСтрока.АдресПочтовыйСтрана = ДанныеСтроки.АдресПочтовыйСтрана.Ссылка;
		НоваяСтрока.АдресПочтовыйИндекс = ДанныеСтроки.АдресПочтовыйИндекс.Значение;
		НоваяСтрока.АдресПочтовыйАдрес = ДанныеСтроки.АдресПочтовыйАдрес.Значение;
		НомерСтрокиФайла = НомерСтрокиФайла + 1;

	КонецЦикла;
	
	Если Отказ Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Возникли ошибки при загрузке файла!");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПодтверждения(ДанныеФайла)
	НомерСтрокиФайла = 17;
	НомерКолонкиКодаКлиента = 1;
	
	Если ВидКДВыплатаДоходов() Тогда
		НомерКолонкиКодЗагрузкиЦБ = 23;
		НомерКолонкиКоличества = 25;
	Иначе
		НомерКолонкиКодЗагрузкиЦБ = 20;
		НомерКолонкиКоличества = 22;
	КонецЕсли;
	
	Пока ЗначениеЗаполнено(ДанныеФайла.Область(НомерСтрокиФайла, НомерКолонкиКодаКлиента).Текст) Цикл
		// Налоги
		Если ВидКДВыплатаДоходов() Тогда
			СтатусНалогоплательщика = СокрЛП(ДанныеФайла.Область(НомерСтрокиФайла, 19).Текст);
			НаличиеНалоговыхЛьгот = СокрЛП(ДанныеФайла.Область(НомерСтрокиФайла, 20).Текст);
			Попытка
				НалоговаяСтавка = Число(ДанныеФайла.Область(НомерСтрокиФайла, 21).Текст);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"Ошибка формата значения в строке %1 в колонке 21: нечисловое значение", НомерСтрокиФайла));
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
		// Основные данные
		Попытка
			Количество = Число(ДанныеФайла.Область(НомерСтрокиФайла, НомерКолонкиКоличества).Текст);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"Ошибка формата значения в строке %1 в колонке %2: нечисловое значение", НомерСтрокиФайла, НомерКолонкиКоличества));
			Возврат;
		КонецПопытки;
		
		КодКлиента = СокрЛП(ДанныеФайла.Область(НомерСтрокиФайла, НомерКолонкиКодаКлиента).Текст);
		ПозицияРазделителя = Найти(КодКлиента, "_");
		Если ПозицияРазделителя = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"Ошибка формата значения в строке %1 в колонке %2: код клиента не содержит символ подчеркивания", НомерСтрокиФайла, НомерКолонкиКодаКлиента));
			Возврат;
		Иначе
			КодСубброкера = Лев(КодКлиента, ПозицияРазделителя-1);
			Если НЕ ЗначениеЗаполнено(КодСубброкера) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"Ошибка формата значения в строке %1 в колонке %2: код клиента не содержит кода субброкера", НомерСтрокиФайла, НомерКолонкиКодаКлиента));
				Возврат;
			КонецЕсли;
			
			КодСубклиента = Сред(КодКлиента, ПозицияРазделителя+1);
			Если НЕ ЗначениеЗаполнено(КодСубклиента) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"Ошибка формата значения в строке %1 в колонке %2: код клиента не содержит кода субклиента", НомерСтрокиФайла, НомерКолонкиКодаКлиента));
				Возврат;
			КонецЕсли;
			
			КодЗагрузкиЦБ = СокрЛП(ДанныеФайла.Область(НомерСтрокиФайла, НомерКолонкиКодЗагрузкиЦБ).Текст);
			Если НЕ ЗначениеЗаполнено(КодЗагрузкиЦБ) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"Ошибка формата значения в строке %1 в колонке %2: не указан код загрузки ЦБ", НомерСтрокиФайла, НомерКолонкиКодЗагрузкиЦБ));
				Возврат;
			КонецЕсли;
			
			НоваяСтрока = Объект.Подтверждения.Добавить();
			НоваяСтрока.КодСубброкера	= КодСубброкера;
			НоваяСтрока.КодСубклиента	= КодСубклиента;
			НоваяСтрока.КодЗагрузкиЦБ	= КодЗагрузкиЦБ;
			НоваяСтрока.Количество		= Количество;
			НоваяСтрока.СчетДепо		= Объект.СчетДепо;
			// Налоги
			Если ВидКДВыплатаДоходов() Тогда
				НоваяСтрока.СтатусНалогоплательщика	= СтатусНалогоплательщика;
				НоваяСтрока.НаличиеНалоговыхЛьгот	= НаличиеНалоговыхЛьгот;
				НоваяСтрока.НалоговаяСтавка			= НалоговаяСтавка;
			КонецЕсли;
		КонецЕсли;
		
		НомерСтрокиФайла = НомерСтрокиФайла + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДополнитьПодтвержденияСсылкамиНаОбъекты()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Если ИспользоватьРегистрациюЗапросовСубброкера Тогда 
		ОбработкаОбъект.ДополнитьПодтвержденияСсылкамиНаОбъекты();
	Иначе 
		ОбработкаОбъект.ДополнитьПодтвержденияСсылкамиНаОбъекты__БезДокументовЗапросов();
	КонецЕсли;
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеПодтвержденияНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьДанныеПодтверждения(Адрес);
КонецПроцедуры

&НаСервере
Процедура ПодобратьДокументРСВ();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПодобратьДокументРСВ();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	Элементы.ГруппаЗагружаемыеПоля.Видимость = Истина;
	Если НЕ ЗначениеЗаполнено(Объект.ДокументРаскрытия) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось подобрать документ раскрытия!");
	Иначе
		ИспользоватьРегистрациюЗапросовСубброкера = WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкераДляДокумента(Объект.ДокументРаскрытия);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПодобратьДокументЗапросаНаРСВ(Номер = "")
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПодобратьДокументЗапросаНаРСВ(Номер);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	Если ЗначениеЗаполнено(Номер) И Не ЗначениеЗаполнено(Объект.ЗапросНаРСВ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ Запроса РСВ " + Номер + " указанный в файле не найден.
		|Укажите документ Запроса РСВ самостоятельно");
	ИначеЕсли ЗначениеЗаполнено(Объект.ДокументРаскрытия) И Не ЗначениеЗаполнено(Объект.ЗапросНаРСВ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось подобрать документ запроса на раскрытие!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолноеИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.ПолноеИмяФайла) Тогда 
		ЗапуститьПриложение(Объект.ПолноеИмяФайла);	
	КонецЕсли;
КонецПроцедуры

////#КонецОбласти

/////////////////////////////////////////////////////////////////////////////
////#Область Вспомогательные

&НаКлиенте
Процедура ПрочитатьФайлСубброкераXML()
	
	ДвоичныеДанные = Новый ДвоичныеДанные(Объект.ПолноеИмяФайла);
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	ПрочитатьФайлСубброкераXMLСервер(Адрес);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлСубброкераXMLСервер(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	ИмяВременногоФайлаXML = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные.Записать(ИмяВременногоФайлаXML);
	
	СообщенияОбОшибках = Новый Массив;
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяВременногоФайлаXML);
	ЧтениеXML.Прочитать();
	
	ПространствоИмен = "FCDR_2017_02(2019v3)";
	ТипXDTO = ФабрикаXDTO.Тип(ПространствоИмен, "REGISTER_OF_SHAREHOLDERS_V02");
	РСВ = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO);
	
	Объект.ЦеннаяБумага = Неопределено;
	
	Депозитарий = ДепозитарийПолучатель(РСВ.header.to.id_2.id);
	Если Не ЗначениеЗаполнено(Депозитарий) Тогда
		Организация = Константы.ОрганизацияПоУмолчанию.Получить();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Указанный LEI не совпадает с LEI " + Организация);
		Возврат;
	КонецЕсли;
	
	Объект.НомерДокумента = ЗначениеСвойства(РСВ.header, "doc_num", СообщенияОбОшибках, "НомерДокумента");
	ЗначениеДатаДокумента = ЗначениеСвойства(РСВ.header.doc_date, "date", СообщенияОбОшибках, "ДатаДокумента");
	Объект.ДатаДокумента = ДатаВремяИзСтроки(ЗначениеДатаДокумента);
	ОтветСубброкера = ОтветСубброкера(Объект.НомерДокумента, Объект.ДатаДокумента);
	Если ЗначениеЗаполнено(ОтветСубброкера) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный ответ уже ранее загружался");
		Возврат;
	КонецЕсли;
	Объект.КодLEIСубброкера = ЗначениеСвойства(РСВ.header.from.id_2, "id", СообщенияОбОшибках, "КодLEIСубброкера");
	ПрочитатьСчетДепо(РСВ.account_dtls.account_id.id);
	Объект.РеференсКД = ЗначениеСвойства(РСВ.corporate_action_reference, "corp_actn_evt_id", СообщенияОбОшибках, "РеференсКД");
	ПрочитатьВидКД(РСВ.corporate_action_reference.corporate_action_code);
	ПодобратьДокументРСВ();
	Объект.НомерЗапросаРСВПоДаннымКлиента = "";
	БлокПоДаннымКлиента = ЗначениеСвойства(РСВ, "request_identification");
	Если БлокПоДаннымКлиента <> Неопределено Тогда
		НомерЗапросаРСВПоДаннымКлиента = ЗначениеСвойства(БлокПоДаннымКлиента, "request_doc_num");
		Если НомерЗапросаРСВПоДаннымКлиента <> Неопределено Тогда
			Объект.НомерЗапросаРСВПоДаннымКлиента = СтрЗаменить(НомерЗапросаРСВПоДаннымКлиента, "ZS", "");
		КонецЕсли;
	КонецЕсли;
	Объект.ДатаФиксацииПоДаннымКлиента = ДатаВремяИзСтроки(ЗначениеСвойства(РСВ, "record_date"));
	Если ЗначениеЗаполнено(Объект.ДокументРаскрытия) Тогда
		Объект.ДатаФиксацииРСВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументРаскрытия, "ДатаФиксации");
	Иначе
		Объект.ДатаФиксацииРСВ = '00010101';
	КонецЕсли;
	Объект.ФорматФайла = Перечисления.ФорматФайлаОтветовНаЗапросыРСВ.XMLFCDR;
	
	Держатели = РСВ.register_list.shareholder;
	Для Каждого ДанныеСтроки Из Держатели Цикл
		СообщенияОбОшибкахКлиента = Новый Массив;
		НомерСчетаДепоКлиента = ЗначениеСвойства(ДанныеСтроки, "shareholder_id",
			СообщенияОбОшибкахКлиента, "НомерСчетаДепоКлиента");
		ПовторныйСчет = Объект.Подтверждения.НайтиСтроки(Новый Структура("НомерСчетаДепоКлиента", НомерСчетаДепоКлиента));
		Если ПовторныйСчет.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА " + НомерСчетаДепоКлиента
				+ " такой номер счета был загружен ранее.");
		КонецЕсли;
		НоваяСтрока = Объект.Подтверждения.Добавить();
		НоваяСтрока.СчетДепо = Объект.СчетДепо;
		НоваяСтрока.НомерСчетаДепоКлиента = НомерСчетаДепоКлиента;
		Security_Balance = ДанныеСтроки.security_balance;
		НоваяСтрока.Количество = ЗначениеСвойства(Security_Balance.total.qty_units, "units",
			СообщенияОбОшибкахКлиента, "Количество");
		КодРазделаСчетаДепо = ЗначениеСвойства(ДанныеСтроки.account_dtls.account_id, "id_subaccount",
			СообщенияОбОшибкахКлиента, "РазделСчетаДепо");
		НоваяСтрока.РазделСчетаДепо = РазделСчетаДепо(КодРазделаСчетаДепо);
		НоваяСтрока.СтатусНалогоплательщика = ЗначениеСвойства(ДанныеСтроки.tax_category, "tax_status_code",
			СообщенияОбОшибкахКлиента, "СтатусНалогоплательщика");
		НоваяСтрока.НаличиеНалоговыхЛьгот = ЗначениеСвойства(ДанныеСтроки.tax_category, "tax_exempt_indicator",
			СообщенияОбОшибкахКлиента, "НаличиеНалоговыхЛьгот");
		Если Security_Balance.security.proprietary_security_code.issuer = "NSDR" Тогда
			НоваяСтрока.КодЗагрузкиЦБ = ЗначениеСвойства(Security_Balance.security.proprietary_security_code,
				"id", СообщенияОбОшибкахКлиента, "КодЗагрузкиЦБ");
		КонецЕсли;
		Party_Dtls = ДанныеСтроки.party_dtls;
		НоваяСтрока.ПолноеНаименованиеЛица = ЗначениеСвойства(Party_Dtls, "name",
			СообщенияОбОшибкахКлиента, "ПолноеНаименованиеЛица");
		
		НоваяСтрока.LEIКодСубброкера = ЗначениеСвойства(ДанныеСтроки.account_dtls.safekeeping_place, "id",
			СообщенияОбОшибкахКлиента, "LEIКодСубброкера");
		НоваяСтрока.ISIN = ЗначениеСвойства(Security_Balance.security, "ISIN_identifier",
			СообщенияОбОшибкахКлиента, "ISIN");
		Если Не ЗначениеЗаполнено(Объект.ЦеннаяБумага) Тогда
			ПрочитатьЦеннуюБумагу(НоваяСтрока.ISIN);
		КонецЕсли;
		НоваяСтрока.ТипСчета = ЗначениеСвойства(ДанныеСтроки.party_account_type, "party_account_type_code",
			СообщенияОбОшибкахКлиента, "ТипСчета");
			
		AddressPartad = ЗначениеСвойства(Party_Dtls.address, "partad", СообщенияОбОшибкахКлиента);
		Если AddressPartad <> Неопределено Тогда
			Страна = Справочники.КлассификаторСтранМира.СтранаПоКодуАльфа2(ЗначениеСвойства(AddressPartad, "country",
				СообщенияОбОшибкахКлиента, "АдресМестонахожденияРегистрацииСтрана"));
			НоваяСтрока.АдресМестонахожденияРегистрацииСтрана = Страна;
			НоваяСтрока.АдресМестонахожденияРегистрацииИндекс 	= ЗначениеСвойства(AddressPartad, "index");
			НоваяСтрока.АдресМестонахожденияРегистрацииАдрес = ЗначениеСвойства(AddressPartad,
				"address", СообщенияОбОшибкахКлиента, "АдресМестонахожденияРегистрацииАдрес");
		КонецЕсли;
			
		ВидДержателя = Party_Dtls.identification_information.свойства()[0].ЛокальноеИмя;
		Если ВидДержателя = "person" Тогда
			НоваяСтрока.ПризнакЮЛФЛ = Перечисления.ЮрФизЛицо.ФизЛицо;
			Информация = Party_Dtls.identification_information.person.person_info;
			КодДокументВладельцаТип = ЗначениеСвойства(Информация.person_id, "person_document_type_code",
				СообщенияОбОшибкахКлиента, "ДокументВладельцаТип");
			НоваяСтрока.ДокументВладельцаТип = Справочники.ДокументыУдостоверяющиеЛичность.НайтиПоРеквизиту("КодИМНС",
				КодДокументВладельцаТип);
			Dtls_Apart = ЗначениеСвойства(Информация.person_id.person_doc_num, "dtls_apart");
			Если Dtls_Apart <> Неопределено Тогда
				НоваяСтрока.ДокументВладельцаНомер = ЗначениеСвойства(Dtls_Apart,
					"doc_num", СообщенияОбОшибкахКлиента, "ДокументВладельцаНомер");
				НоваяСтрока.ДокументВладельцаСерия = ЗначениеСвойства(Dtls_Apart,
					"doc_ser", СообщенияОбОшибкахКлиента, "ДокументВладельцаСерия");
			Иначе
				НоваяСтрока.ДокументВладельцаНомер = ЗначениеСвойства(Информация.person_id.person_doc_num,
					"doc_num", СообщенияОбОшибкахКлиента, "ДокументВладельцаНомер");
			КонецЕсли;
			ЗначениеДатаВыдачи = ЗначениеСвойства(Информация.person_id, "doc_date", СообщенияОбОшибкахКлиента, "ДокументВладельцаДатаВыдачи");
			НоваяСтрока.ДокументВладельцаДатаВыдачи = ДатаВремяИзСтроки(ЗначениеДатаВыдачи);
			НоваяСтрока.ДокументВладельцаОрганВыдачи = ЗначениеСвойства(Информация.person_id, "org",
				СообщенияОбОшибкахКлиента, "ДокументВладельцаОрганВыдачи");
			ЗначениеДатаРожденияФЛ = ЗначениеСвойства(Информация, "birthday", СообщенияОбОшибкахКлиента, "ДатаРожденияФЛ");
			НоваяСтрока.ДатаРожденияФЛ = ДатаВремяИзСтроки(ЗначениеДатаРожденияФЛ);
			Nationality = ЗначениеСвойства(Информация, "nationality");
			Если Nationality <> Неопределено Тогда
				НоваяСтрока.ГражданствоФЛ = Справочники.КлассификаторСтранМира.СтранаПоКодуАльфа2(Nationality);
			КонецЕсли;
		ИначеЕсли ВидДержателя = "organization" Тогда
			НоваяСтрока.ПризнакЮЛФЛ = Перечисления.ЮрФизЛицо.ЮрЛицо;
			Информация = Party_Dtls.identification_information.organization.organization_info;
			Organization_Id = Информация.organization_id;
			КодДокументВладельцаТип = ЗначениеСвойства(Organization_Id, "organization_code_type",
				СообщенияОбОшибкахКлиента, "ДокументВладельцаТип");
			НоваяСтрока.ДокументВладельцаТип = Справочники.ДокументыЮридическихЛиц.НайтиПоКоду(КодДокументВладельцаТип);
			Dtls_Apart = ЗначениеСвойства(Organization_Id.org_doc_num, "dtls_apart");
			Если Dtls_Apart <> Неопределено Тогда
				НоваяСтрока.ДокументВладельцаНомер = ЗначениеСвойства(Dtls_Apart,
					"doc_num", СообщенияОбОшибкахКлиента, "ДокументВладельцаНомер");
				НоваяСтрока.ДокументВладельцаСерия = ЗначениеСвойства(Dtls_Apart,
					"doc_ser", СообщенияОбОшибкахКлиента, "ДокументВладельцаСерия");
			Иначе 
				НоваяСтрока.ДокументВладельцаНомер = ЗначениеСвойства(Organization_Id.org_doc_num,
					"doc_num", СообщенияОбОшибкахКлиента, "ДокументВладельцаНомер");
			КонецЕсли;
			ЗначениеДатаВыдачи = ЗначениеСвойства(Organization_Id, "doc_date", СообщенияОбОшибкахКлиента, "ДокументВладельцаДатаВыдачи");
			НоваяСтрока.ДокументВладельцаДатаВыдачи = ДатаВремяИзСтроки(ЗначениеДатаВыдачи);
			НоваяСтрока.ДокументВладельцаОрганВыдачи = ЗначениеСвойства(Organization_Id, "reg_org",
				СообщенияОбОшибкахКлиента, "ДокументВладельцаОрганВыдачи");
			Date_Of_Incorporation = ЗначениеСвойства(Информация, "date_of_incorporation");
			Если Date_Of_Incorporation <> Неопределено Тогда
				НоваяСтрока.ДатаРожденияФЛ = ДатаВремяИзСтроки(Date_Of_Incorporation);
			КонецЕсли;
			Country_Of_Incorporation = ЗначениеСвойства(Информация, "country_of_incorporation");
			Если Country_Of_Incorporation <> Неопределено Тогда
				НоваяСтрока.ГражданствоФЛ = Справочники.КлассификаторСтранМира.СтранаПоКодуАльфа2(Country_Of_Incorporation);
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока.ПолноеНаименованиеЮЛФЛСубклиента = ЗначениеСвойства(ДанныеСтроки.postal_name, "name",
			СообщенияОбОшибкахКлиента, "ПолноеНаименованиеЮЛФЛСубклиента");
		AddressPartad = ЗначениеСвойства(ДанныеСтроки.postal_name.address, "partad",
			СообщенияОбОшибкахКлиента);
		Если AddressPartad <> Неопределено Тогда
			ЗначениеСтрана = ЗначениеСвойства(AddressPartad, "country", СообщенияОбОшибкахКлиента, "АдресПочтовыйСтрана");
			НоваяСтрока.АдресПочтовыйСтрана = Справочники.КлассификаторСтранМира.СтранаПоКодуАльфа2(ЗначениеСтрана);
			НоваяСтрока.АдресПочтовыйИндекс = ЗначениеСвойства(AddressPartad, "index");
			НоваяСтрока.АдресПочтовыйАдрес = ЗначениеСвойства(AddressPartad, "address",
				СообщенияОбОшибкахКлиента, "АдресПочтовыйАдрес");
		КонецЕсли;
		Если СообщенияОбОшибкахКлиента.Количество() <> 0 Тогда
			СообщениеОбОшибкеКлиента = "У клиента " + НоваяСтрока.ПолноеНаименованиеЮЛФЛСубклиента + ":"
				+ Символы.ПС + СтрСоединить(СообщенияОбОшибкахКлиента, "," + Символы.ПС);
			СообщенияОбОшибках.Добавить(СообщениеОбОшибкеКлиента);
		КонецЕсли;
	КонецЦикла;
	
	Если СообщенияОбОшибках.Количество() <> 0 Тогда
		СообщениеОшибки = СтрСоединить(СообщенияОбОшибках, "," + Символы.ПС);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеСвойства(Объект, ИмяСвойства, СообщенияОбОшибках = Неопределено, СвязанныйРеквизит = Неопределено)
	ЗначениеСвойства = Неопределено;
	ПроверяемоеСвойство = Объект.Свойства().Получить(ИмяСвойства);
	ЕстьСвойство = ПроверяемоеСвойство <> Неопределено;
	Если ЕстьСвойство Тогда
		ЗначениеСвойства = Объект.Получить(ПроверяемоеСвойство);
		Если ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") И ЗначениеСвойства.Свойства().Количество() = 0 Тогда
			ЗначениеСвойства = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если СообщенияОбОшибках <> Неопределено И ЗначениеСвойства = Неопределено Тогда
		
		ВидОшибки = ?(ЕстьСвойство, "Не заполнено", "Не существует");
		ТекстОшибки = ВидОшибки + " свойство " + ИмяСвойства
		+ ?(СвязанныйРеквизит <> Неопределено, " для " + СвязанныйРеквизит, "");
		СообщенияОбОшибках.Добавить(ТекстОшибки);
		
	КонецЕсли;
	
	Возврат ЗначениеСвойства;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДепозитарийПолучатель(LEI)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.LEI = &LEI";
	Запрос.УстановитьПараметр("LEI", LEI);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтветСубброкера(Номер, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтветСубброкераНаРаскрытие.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтветСубброкераНаРаскрытие КАК ОтветСубброкераНаРаскрытие
	|ГДЕ
	|	ОтветСубброкераНаРаскрытие.НомерДокументаСубброкера = &НомерДокументаСубброкера
	|	И ОтветСубброкераНаРаскрытие.ДатаДокументаСубброкера МЕЖДУ &НачалоДня И &КонецДня";
	Запрос.УстановитьПараметр("НомерДокументаСубброкера", Номер);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Дата));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДатаВремяИзСтроки(Строка)
	
	Если Строка <> Неопределено Тогда
		Возврат XMLЗначение(Тип("Дата"), Строка);
	Иначе
		Возврат '00010101';
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СчетДепоСоответствуетСчетуРСВ(СчетДепо, ЗапросНаРСВ)
	Возврат СчетДепо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗапросНаРСВ, "СчетДЕПО");
КонецФункции
